Autodesk.Revit.DB.DirectShape.AreOptionsValidForTransientDirectShape(Autodesk.Revit.DB.DirectShapeOptions)
Validates that the given DirectShapeOptions are allowed if this DirectShape is transient.
options:
The options
Returns:
True if the DirectShapeOptions are valid; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.IsValidCategoryId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Test the category id to make sure it is indeed a top-level built-in category
categoryId:
Category id to be tested
doc:
Document to look up the category by id
Returns:
False unless categoryId corresponds to a valid built-in top-level model category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.SetOptions(Autodesk.Revit.DB.DirectShapeOptions)
Sets the options to use for this DirectShape.
Remarks:
The new options take effect immediately.
If this DirectShape relies on a DirectShapeType for references, the options stored in DirectShapeType take precedence.
Note that changing options affects how the object interacts with Revit. E.g., switching references off will disable
existing constraints applied to that object.
options:
options to use for this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The DirectShapeOptions provided are not valid for this DirectShape.
-or-
The DirectShapeOptions provided are not valid for this transient DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.AreOptionsValid(Autodesk.Revit.DB.DirectShapeOptions)
Validates that the given DirectShapeOptions are allowed for this particular DirectShape.
options:
The options
Returns:
True if the DirectShapeOptions are valid; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.AppendShape(Autodesk.Revit.DB.ShapeBuilder)
Append shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShape.
The data stored in the supplied ShapeBuilder object will be cleared.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have teh correct appearance in Revit.
This function will bypass extra geometry validation because the built geometry has already been validated by the ShapeBuilder.
It is therefore slightly more efficient than the AppendShape() routine that accepts GeometryObjects directly as input.
ShapeBuilder:
The ShapeBuilder object that was used to build the shape to be appended.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.AppendShape(System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Appends the collection of Geometry objects into the model or view specific shape representation stored in this DirectShape.
Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
pGeomArr:
Shape expressed as a collection of Geometry objects
viewType:
Passing DirectShapeTargetViewType.Default as view type will cause the default shape to be appended.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DirectShape.AppendShape(System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject})
Appends the collection of Geometry objects into the model shape representation stored in this DirectShape.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
pGeomArr:
Shape expressed as a collection of Geometry objects
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.SetShape(Autodesk.Revit.DB.ShapeBuilder)
Sets the shape of this object to the one accumulated in the supplied Builder object.
If the new shape is identical to the old one, the old shape will be kept.
Remarks:
This function will bypass extra geometry validation because the built geometry has already been validated by the ShapeBuilder.
It is therefore slightly more efficient than the SetShape() routine that accepts GeometryObjects directly as input.
Supplying a ViewShapeBuilder object as argument will cause the view-specific shape of this DirectShape to be updated.
Supplying other ShapeBuilder types will update the model shape.
pBuilder:
A ShapeBuilder object that was used to successfully build geometry to store in this DirectShape. The built shape will be transferred to the DirectShape,
and the ShapeBuilder object will be reset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShape.SetShape(System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Builds the shape of this object from the supplied collection of Geometry objects. The objects are copied.
If the new shape is identical to the old one, the old shape will be kept.
pGeomArr:
Shape of this object expressed as a collection of Geometry objects
viewType:
Optional: set a view-specific shape representation that will be used in views of that type only.
Passing DirectShapeTargetViewType::Default as view type will cause the default shape to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DirectShape.SetShape(System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject})
Builds the shape of this object from the supplied collection of Geometry objects. The objects are copied.
If the new shape is identical to the old one, the old shape will be kept.
pGeomArr:
Shape of this object expressed as a collection of Geometry objects
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.CreateElementInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.String,Autodesk.Revit.DB.Transform,System.String,System.String)
Create a DirectShape object and add it to document.
The shape stored in the element is either a reference or a copy of a definition shape
that was created earlier. How the definitions are stored will determine whether an instance or a copy of the
shape will be created. See DirectShapeLibrary for more details.
This function is included for convenience. It essentially combines CreateGeometryInstance and CreateElement.
Remarks:
This is intended to support a definition/instance pattern
common in CAD formats - DWG blocks, STEP MAPPED_ITEM, IFC IfcMappedItem.
Use DirectShapeLibrary class to store definitions prior to using them here.
document:
Document to which the created element will be added
typeId:
Element id of a DirectShapeType element.
categoryId:
Id of the category assigned to this DirectShape. Must be a valid category id.
definition_id:
ID of the shape definition that was created earlier and stored via DirectShapeLibrary
trf:
Transform to be applied to the definition
appGUID:
Identifies the creating application. May not be empty.
appDataGUID:
Optional, to be used by the creating application. The intended use is
to identify the native data that was the source of this DirectShape.
Returns:
DirectShape object if created successfully, NULL otherwise
Throws Autodesk.Revit.Exceptions.ArgumentException:
Element id categoryId does not correspond to a top-level built-in model category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.CreateElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,System.String)
Create a DirectShape object and add it to document.
document:
Document to which the created element will be added
categoryId:
Id of the category assigned to this DirectShape. Must be a valid category id.
appGUID:
Identifies the creating application. May not be empty.
appDataGUID:
Optional, to be used by the creating application. The intended use is
to identify the native data that was the source of this DirectShape.
Returns:
DirectShape object if created successfully, NULL otherwise
Throws Autodesk.Revit.Exceptions.ArgumentException:
Element id categoryId does not correspond to a top-level built-in model category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015